Reports/ОтчетДляКонтроляКорректностиВыкупаТОХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОтчетДляКонтроляКорректностиВыкупаТОХ</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ТоварыТОХпоДаннымПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыТОХпоДаннымПоставщиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОтветственногоХраненияПереданные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОтветственногоХраненияПереданные</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИнформационныеБазыФилиалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИнформационныеБазыФилиалов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГоловноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НазваниеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НазваниеБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Альметьевск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Владимир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Восток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Калуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Киров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Липецк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Молодогвардейская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НабережныеЧелны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НижнийНовгород</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пенза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятигорск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рязань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Саранск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Север</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тамбов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тверь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тула</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ульяновск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чебоксары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шахты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮГ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ярославль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОтчетДляКонтроляКорректностиВыкупаТОХ/Ext/ObjectModule.bsl
Перем Филиал Экспорт;
Перем СтруктураПараметров Экспорт;
Перем ДатаНачалаУчетаВФилиалах Экспорт;

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Если ПолучитьЗначениеПараметра("УчитыватьСерии") = Ложь Тогда
		Для Каждого Группировка Из КомпоновщикНастроек.Настройки.Структура Цикл
			Для Каждого Таблица Из Группировка.Структура Цикл
				Для Каждого Строка Из Таблица.Строки Цикл
					Для Каждого ЭлементСтруктуры Из Строка.Структура Цикл
						ОтключитьИспользованиеСерииНоменклатуры(ЭлементСтруктуры);
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;		
		
	Для Каждого КлючИЗначение Из СтруктураПараметров Цикл
		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Если Найти(КлючИЗначение.Ключ, "Отбор") = 0 Тогда
				УстановитьЗначениеПараметра(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			Иначе
				УстановитьЗначениеОтбора(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Филиал = СтруктураПараметров.Филиал;
	ДатаНачалаУчетаВФилиалах = СтруктураПараметров.ДатаНачалаУчетаВФилиалах;
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен параметр Филиал", , , , Отказ);
	Иначе
		СтруктураПодключения = ПолучитьПараметрыПодключения();
		Если Не ЗначениеЗаполнено(СтруктураПодключения.ИмяСервера) ИЛИ Не ЗначениеЗаполнено(СтруктураПодключения.ИмяИнформационнойБазы)
			ИЛИ Не ЗначениеЗаполнено(СтруктураПодключения.Логин) ИЛИ Не ЗначениеЗаполнено(СтруктураПодключения.Пароль) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не заполнены параметры подключения к базе филиала %1 (РС Информационные базы филиалов)", Филиал), , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПолучитьЗначениеПараметра("Период").ДатаНачала) ИЛИ Не ЗначениеЗаполнено(ПолучитьЗначениеПараметра("Период").ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некорректно заполнен параметр Период", , , , Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФилиалов = ПолучитьДанныеФилиалов();
	Если ДанныеФилиалов = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибки при подключении к базе УТ10 филиала. Проверьте параметры подключения в РС Информационные базы филиалов");
		Возврат;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаРаздела4", ДанныеФилиалов.ТаблицаРаздела4);	//Сопоставление маленьких выкупов ЦП и ОП построчно
	ВнешниеНаборыДанных.Вставить("ТаблицаРаздела5", ДанныеФилиалов.ТаблицаРаздела5);	//Сопоставление маленьких выкупов ЦП и ОП по свойствам документов
	ВнешниеНаборыДанных.Вставить("ТаблицаРаздела7", ДанныеФилиалов.ТаблицаРаздела7);	//Сопоставление остатков регистра ЦП и ОП
	ВнешниеНаборыДанных.Вставить("ТаблицаРаздела8", ДанныеФилиалов.ТаблицаРаздела8);	//Сопоставление документов РТУ ОХ И ПТОХ
	ВнешниеНаборыДанных.Вставить("ТаблицаРаздела9", ДанныеФилиалов.ТаблицаРаздела9);	//Сопоставление документов РТУ ОХ И ПТОХ по номенклатуре

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
	
КонецПроцедуры

Процедура ОтключитьИспользованиеСерииНоменклатуры(РодСтруктура)
	
	Для Каждого ЭлементСтруктуры Из РодСтруктура.Структура Цикл
		Если ЭлементСтруктуры.Структура.Количество() = 0 Тогда
			Для Каждого ЭлементПоляГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				Если Найти(Строка(ЭлементПоляГруппировки.Поле), "СерияНоменклатуры") > 0 Тогда
					ЭлементПоляГруппировки.Использование = Ложь;
				КонецЕсли;
			КонецЦикла;			
		Иначе
			ОтключитьИспользованиеСерииНоменклатуры(ЭлементСтруктуры);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеФилиалов()
	
	БазаФилиал = ПодключитьсяКБазе();
	Если БазаФилиал = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УчитыватьСерии = ПолучитьЗначениеПараметра("УчитыватьСерии");
	
	ОтборПоКонтрагенту = ПолучитьЗначениеПараметра("Контрагент");
    Если ЗначениеЗаполнено(ОтборПоКонтрагенту) Тогда
		МассивКонтрагентов = Новый Массив;
		МассивКонтрагентовБазаФилиал = БазаФилиал.NewObject("Массив");
		Если ТипЗнч(ОтборПоКонтрагенту) = Тип("СписокЗначений") Тогда
			Для Каждого ЭлементСписка Из ОтборПоКонтрагенту Цикл
				МассивКонтрагентов.Добавить(ЭлементСписка.Значение.КодМДМ);
				МассивКонтрагентовБазаФилиал.Добавить(ЭлементСписка.Значение.КодМДМ);
			КонецЦикла;
		Иначе
			МассивКонтрагентов.Добавить(ОтборПоКонтрагенту.КодМДМ);
			МассивКонтрагентовБазаФилиал.Добавить(ОтборПоКонтрагенту.КодМДМ);
		КонецЕсли;
	КонецЕсли;	
	
	ОтборПоДоговору = ПолучитьЗначениеПараметра("ДоговорКонтрагента");
    Если ЗначениеЗаполнено(ОтборПоДоговору) Тогда
		МассивДоговоров = Новый Массив;
		МассивДоговоровБазаФилиал = БазаФилиал.NewObject("Массив");
		Если ТипЗнч(ОтборПоДоговору) = Тип("СписокЗначений") Тогда
			Для Каждого ЭлементСписка Из ОтборПоДоговору Цикл
				МассивДоговоров.Добавить(ЭлементСписка.Значение.КодМДМ);
				МассивДоговоровБазаФилиал.Добавить(ЭлементСписка.Значение.КодМДМ);
			КонецЦикла;
		Иначе
			МассивДоговоров.Добавить(ОтборПоДоговору.КодМДМ);
			МассивДоговоровБазаФилиал.Добавить(ОтборПоДоговору.КодМДМ);
		КонецЕсли;
	КонецЕсли;	
	
	ДатаНачала = СтруктураПараметров.Период.ДатаНачала;
	ДатаОкончания = СтруктураПараметров.Период.ДатаОкончания;
	
	Запрос = БазаФилиал.NewObject("Запрос");
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Контрагент.КодМДМ КАК КодМДМКонтрагента,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка КАК ГУИДФилиалВыкупа,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Номер КАК НомерФилиалВыкупа,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Дата КАК ДатаФилиалВыкупа,
	               |	ВыкупСОтветственногоХраненияТовары.Номенклатура.КодМДМ КАК КодМДМНоменклатуры,
	               |	СУММА(ВыкупСОтветственногоХраненияТовары.Количество) КАК КоличествоИсточника,
	               |	ВЫБОР
	               |		КОГДА &УчитыватьСерии
	               |			ТОГДА ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры.НомерГТД.Код
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК СерияНоменклатуры
	               |ИЗ
	               |	Документ.ВыкупСОтветственногоХранения.Товары КАК ВыкупСОтветственногоХраненияТовары
	               |ГДЕ
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Дата >= &ДатаНачала
	               |	И ВыкупСОтветственногоХраненияТовары.Ссылка.Дата <= &ДатаОкончания
	               |	И ВыкупСОтветственногоХраненияТовары.Количество <> 0
	               |	И НЕ ВыкупСОтветственногоХраненияТовары.Ссылка.ПометкаУдаления
	               |	И &УсловиеПоКонтрагенту
	               |	И &УсловиеПоДоговору
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Контрагент.КодМДМ,
	               |	ВЫБОР
	               |		КОГДА &УчитыватьСерии
	               |			ТОГДА ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры.НомерГТД.Код
	               |		ИНАЧЕ """"
	               |	КОНЕЦ,
	               |	ВыкупСОтветственногоХраненияТовары.Номенклатура.КодМДМ,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Номер,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Дата,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Контрагент.КодМДМ КАК КодМДМКонтрагента,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка КАК ГУИДФилиалВыкупа,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Номер КАК НомерФилиалВыкупа,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Дата КАК ДатаФилиалВыкупа,
	               |	ВыкупСОтветственногоХраненияТовары.ПометкаУдаления КАК ПометкаУдаления,
	               |	ВыкупСОтветственногоХраненияТовары.Проведен КАК Проведен
	               |ИЗ
	               |	Документ.ВыкупСОтветственногоХранения КАК ВыкупСОтветственногоХраненияТовары
	               |ГДЕ
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Дата >= &ДатаНачала
	               |	И ВыкупСОтветственногоХраненияТовары.Ссылка.Дата <= &ДатаОкончания
	               |	И &УсловиеПоКонтрагенту
	               |	И &УсловиеПоДоговору
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Контрагент.КодМДМ,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Номер,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Дата,
	               |	ВыкупСОтветственногоХраненияТовары.ПометкаУдаления,
	               |	ВыкупСОтветственногоХраненияТовары.Проведен";
	
	Запрос.УстановитьПараметр("ДатаНачала", Макс(ДатаНачала, ДатаНачалаУчетаВФилиалах));
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("УчитыватьСерии", УчитыватьСерии);
	
    Если ЗначениеЗаполнено(ОтборПоКонтрагенту) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКонтрагенту", "ВыкупСОтветственногоХраненияТовары.Ссылка.Контрагент.КодМДМ В(&КодМДМКонтрагента)");
		Запрос.УстановитьПараметр("КодМДМКонтрагента", МассивКонтрагентовБазаФилиал);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПоКонтрагенту", Истина);
	КонецЕсли;	
    Если ЗначениеЗаполнено(ОтборПоДоговору) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДоговору", "ВыкупСОтветственногоХраненияТовары.Ссылка.ДоговорКонтрагента.КодМДМ = &КодМДМДоговораКонтрагента");
		Запрос.УстановитьПараметр("КодМДМДоговораКонтрагента", МассивДоговоровБазаФилиал);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПоДоговору", Истина);
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;	
	
	РезультатБазаФилиал = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК КодМДМКонтрагента,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ГУИДФилиалВыкупа,
	               |	ВЫРАЗИТЬ(ДАТАВРЕМЯ(1, 1, 1) КАК ДАТА) КАК ДатаФилиалВыкупа,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК НомерФилиалВыкупа,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК КодМДМНоменклатуры,
	               |	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 3)) КАК КоличествоИсточника,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК СерияНоменклатуры";
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	ТЗ.Очистить();

	Выборка = РезультатБазаФилиал.Получить(0).Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ГУИДФилиалВыкупа = БазаФилиал.XMLСтрока(Выборка.ГУИДФилиалВыкупа);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаВыкуповИсточника.КодМДМКонтрагента КАК КодМДМКонтрагента,
	               |	ТаблицаВыкуповИсточника.ГУИДФилиалВыкупа КАК ГУИДФилиалВыкупа,
	               |	ТаблицаВыкуповИсточника.ДатаФилиалВыкупа КАК ДатаФилиалВыкупа,
	               |	ТаблицаВыкуповИсточника.НомерФилиалВыкупа КАК НомерФилиалВыкупа,
	               |	ТаблицаВыкуповИсточника.КодМДМНоменклатуры КАК КодМДМНоменклатуры,
	               |	ТаблицаВыкуповИсточника.СерияНоменклатуры КАК СерияНоменклатуры,
	               |	ТаблицаВыкуповИсточника.КоличествоИсточника КАК КоличествоИсточника
	               |ПОМЕСТИТЬ ВТТаблицаВыкуповИсточника
	               |ИЗ
	               |	&ТЗ КАК ТаблицаВыкуповИсточника
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыкупСОтветственногоХраненияТовары.Номенклатура.КодМДМ КАК КодМДМНоменклатуры,
	               |	ВЫБОР
	               |		КОГДА &УчитыватьСерии
	               |			ТОГДА ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры.НомерГТД.Код
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК СерияНоменклатуры,
	               |	СУММА(ВыкупСОтветственногоХраненияТовары.Количество) КАК КоличествоПриемника,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.ИДДокументаВСмежнойБазе
	               |ПОМЕСТИТЬ ВТТаблицаВыкуповПриемника
	               |ИЗ
	               |	Документ.ВыкупСОтветственногоХранения.Товары КАК ВыкупСОтветственногоХраненияТовары
	               |ГДЕ
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.Дата >= &ДатаНачала
	               |	И ВыкупСОтветственногоХраненияТовары.Ссылка.Дата <= &ДатаОкончания
	               |	И &УсловиеПоКонтрагенту
	               |	И &УсловиеПоДоговору
	               |	И НЕ ВыкупСОтветственногоХраненияТовары.Ссылка.ПометкаУдаления
	               |	И ВыкупСОтветственногоХраненияТовары.Ссылка.Филиал = &Филиал
	               |	И ВыкупСОтветственногоХраненияТовары.Ссылка.ИДДокументаВСмежнойБазе <> ""                                    ""
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыкупСОтветственногоХраненияТовары.Номенклатура.КодМДМ,
	               |	ВЫБОР
	               |		КОГДА &УчитыватьСерии
	               |			ТОГДА ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры.НомерГТД.Код
	               |		ИНАЧЕ """"
	               |	КОНЕЦ,
	               |	ВыкупСОтветственногоХраненияТовары.Ссылка.ИДДокументаВСмежнойБазе
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТаблицаВыкуповИсточника.ГУИДФилиалВыкупа,
	               |	ВТТаблицаВыкуповИсточника.КодМДМНоменклатуры,
	               |	ВТТаблицаВыкуповИсточника.СерияНоменклатуры,
	               |	ВТТаблицаВыкуповИсточника.КоличествоИсточника КАК КоличествоИсточника,
	               |	0 КАК КоличествоПриемника
	               |ПОМЕСТИТЬ ВТТаблицаСопоставления
	               |ИЗ
	               |	ВТТаблицаВыкуповИсточника КАК ВТТаблицаВыкуповИсточника
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТТаблицаВыкуповПриемника.ИДДокументаВСмежнойБазе,
	               |	ВТТаблицаВыкуповПриемника.КодМДМНоменклатуры,
	               |	ВТТаблицаВыкуповПриемника.СерияНоменклатуры,
	               |	0,
	               |	ВТТаблицаВыкуповПриемника.КоличествоПриемника
	               |ИЗ
	               |	ВТТаблицаВыкуповПриемника КАК ВТТаблицаВыкуповПриемника
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТаблицаСопоставления.ГУИДФилиалВыкупа,
	               |	ВТТаблицаСопоставления.КодМДМНоменклатуры,
	               |	ВТТаблицаСопоставления.СерияНоменклатуры,
	               |	СУММА(ВТТаблицаСопоставления.КоличествоИсточника) КАК КоличествоИсточника,
	               |	СУММА(ВТТаблицаСопоставления.КоличествоПриемника) КАК КоличествоПриемника
	               |ПОМЕСТИТЬ ВТВремИтоги
	               |ИЗ
	               |	ВТТаблицаСопоставления КАК ВТТаблицаСопоставления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТТаблицаСопоставления.ГУИДФилиалВыкупа,
	               |	ВТТаблицаСопоставления.КодМДМНоменклатуры,
	               |	ВТТаблицаСопоставления.СерияНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""Малые выкупы в ГП не соответствуют Малым выкупам в ОП"" КАК Раздел4,
	               |	ВТВремИтоги.ГУИДФилиалВыкупа КАК ГУИДФилиалВыкупаРаздел4,
	               |	ВТВремИтоги.КодМДМНоменклатуры КАК КодМДМНоменклатурыРаздел4,
	               |	ВТВремИтоги.СерияНоменклатуры КАК СерияНоменклатурыРаздел4,
	               |	ВТВремИтоги.КоличествоИсточника КАК КоличествоИсточникаРаздел4,
	               |	ВТВремИтоги.КоличествоПриемника КАК КоличествоПриемникаРаздел4,
	               |	ВТВремИтоги.КоличествоИсточника - ВТВремИтоги.КоличествоПриемника КАК ОтклонениеРаздел4,
	               |	ВыкупСОтветственногоХранения.Ссылка КАК ФилиалВыкупРаздел4,
	               |	Номенклатура.Ссылка КАК НоменклатураРаздел4,
	               |	ВТТаблицаВыкуповИсточника.ДатаФилиалВыкупа КАК ДатаФилиалВыкупаРаздел4,
	               |	ВТТаблицаВыкуповИсточника.НомерФилиалВыкупа КАК НомерФилиалВыкупаРаздел4,
	               |	ВЫБОР
	               |		КОГДА ВТТаблицаВыкуповИсточника.КодМДМКонтрагента ЕСТЬ NULL
	               |			ТОГДА ВыкупСОтветственногоХранения.Ссылка.Контрагент
	               |		ИНАЧЕ Контрагенты.Ссылка
	               |	КОНЕЦ КАК КонтрагентРаздел4
	               |ИЗ
	               |	ВТВремИтоги КАК ВТВремИтоги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыкупСОтветственногоХранения КАК ВыкупСОтветственногоХранения
	               |		ПО ВТВремИтоги.ГУИДФилиалВыкупа = ВыкупСОтветственногоХранения.ИДДокументаВСмежнойБазе
	               |			И (НЕ ВыкупСОтветственногоХранения.ПометкаУдаления)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |		ПО ВТВремИтоги.КодМДМНоменклатуры = Номенклатура.КодМДМ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаВыкуповИсточника КАК ВТТаблицаВыкуповИсточника
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |			ПО (Контрагенты.КодМДМ = ВТТаблицаВыкуповИсточника.КодМДМКонтрагента)
	               |		ПО ВТВремИтоги.ГУИДФилиалВыкупа = ВТТаблицаВыкуповИсточника.ГУИДФилиалВыкупа
	               |			И ВТВремИтоги.КодМДМНоменклатуры = ВТТаблицаВыкуповИсточника.КодМДМНоменклатуры
	               |			И ВТВремИтоги.СерияНоменклатуры = ВТТаблицаВыкуповИсточника.СерияНоменклатуры
	               |ГДЕ
	               |	ВТВремИтоги.КоличествоИсточника <> ВТВремИтоги.КоличествоПриемника
	               |	И НЕ Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("ДатаНачала", Макс(ДатаНачала, ДатаНачалаУчетаВФилиалах));
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("УчитыватьСерии", УчитыватьСерии);
	
	Если ЗначениеЗаполнено(ОтборПоКонтрагенту) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКонтрагенту", "ВыкупСОтветственногоХраненияТовары.Ссылка.Контрагент.КодМДМ В(&КодМДМКонтрагента)");
		Запрос.УстановитьПараметр("КодМДМКонтрагента", МассивКонтрагентов);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПоКонтрагенту", Истина);
	КонецЕсли;	
    Если ЗначениеЗаполнено(ОтборПоДоговору) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДоговору", "ВыкупСОтветственногоХраненияТовары.Ссылка.ДоговорКонтрагента.КодМДМ = &КодМДМДоговораКонтрагента");
		Запрос.УстановитьПараметр("КодМДМДоговораКонтрагента", МассивДоговоров);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПоДоговору", Истина);
	КонецЕсли;	
	Запрос.Текст = ТекстЗапроса;	
	
	Результат = Запрос.Выполнить();
	ТаблицаРаздела4 = Результат.Выгрузить();
	Для Каждого Строка Из ТаблицаРаздела4 Цикл
		Если Не ЗначениеЗаполнено(Строка.НомерФилиалВыкупаРаздел4) Тогда
			ДокументВФилиале = БазаФилиал.Документы.ВыкупСОтветственногоХранения.ПолучитьСсылку(БазаФилиал.NewObject("УникальныйИдентификатор", СокрЛП(Строка.ГУИДФилиалВыкупаРаздел4)));
			Строка.НомерФилиалВыкупаРаздел4 = ДокументВФилиале.Номер;
			Строка.ДатаФилиалВыкупаРаздел4 = ДокументВФилиале.Дата;
			Строка.КонтрагентРаздел4 = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ДокументВФилиале.Контрагент.КодМДМ);
		КонецЕсли;
	КонецЦикла;			

	//Раздел 5
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК КодМДМКонтрагента,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ГУИДФилиалВыкупа,
	               |	ВЫРАЗИТЬ(ДАТАВРЕМЯ(1, 1, 1) КАК ДАТА) КАК ДатаФилиалВыкупа,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК НомерФилиалВыкупа,
	               |	ЛОЖЬ КАК Проведен,
	               |	ЛОЖЬ КАК ПометкаУдаления";

	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	ТЗ.Очистить();

	Выборка = РезультатБазаФилиал.Получить(1).Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ГУИДФилиалВыкупа = БазаФилиал.XMLСтрока(Выборка.ГУИДФилиалВыкупа);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаВыкуповИсточника.КодМДМКонтрагента КАК КодМДМКонтрагента,
	               |	ТаблицаВыкуповИсточника.ГУИДФилиалВыкупа КАК ГУИДФилиалВыкупа,
	               |	ТаблицаВыкуповИсточника.ДатаФилиалВыкупа КАК ДатаФилиалВыкупа,
	               |	ТаблицаВыкуповИсточника.НомерФилиалВыкупа КАК НомерФилиалВыкупа,
	               |	ТаблицаВыкуповИсточника.Проведен КАК Проведен,
	               |	ТаблицаВыкуповИсточника.ПометкаУдаления КАК ПометкаУдаления
	               |ПОМЕСТИТЬ ВТТаблицаВыкуповИсточника
	               |ИЗ
	               |	&ТЗ КАК ТаблицаВыкуповИсточника
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыкупСОтветственногоХранения.Ссылка КАК ФилиалВыкупРаздел5,
	               |	ВыкупСОтветственногоХранения.ПометкаУдаления КАК ПометкаУдаленияРаздел5,
	               |	ВыкупСОтветственногоХранения.Проведен КАК ПроведенРаздел5,
	               |	ВТТаблицаВыкуповИсточника.Проведен КАК ПроведенФилиалВыкупРаздел5,
	               |	ВТТаблицаВыкуповИсточника.ПометкаУдаления КАК ПометкаУдаленияФилиалВыкупРаздел5,
	               |	ВТТаблицаВыкуповИсточника.ГУИДФилиалВыкупа КАК ГУИДФилиалВыкупаРаздел5,
	               |	ВТТаблицаВыкуповИсточника.ДатаФилиалВыкупа КАК ДатаФилиалВыкупаРаздел5,
	               |	ВТТаблицаВыкуповИсточника.НомерФилиалВыкупа КАК НомерФилиалВыкупаРаздел5,
	               |	ВЫБОР
	               |		КОГДА ВТТаблицаВыкуповИсточника.КодМДМКонтрагента ЕСТЬ NULL
	               |			ТОГДА ВыкупСОтветственногоХранения.Ссылка.Контрагент
	               |		ИНАЧЕ Контрагенты.Ссылка
	               |	КОНЕЦ КАК КонтрагентРаздел5,
	               |	ВЫБОР
	               |		КОГДА ВыкупСОтветственногоХранения.Ссылка <> НЕОПРЕДЕЛЕНО
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТТаблицаВыкуповИсточника.Проведен <> ВыкупСОтветственногоХранения.Проведен
	               |							ИЛИ ВТТаблицаВыкуповИсточника.ПометкаУдаления <> ВыкупСОтветственногоХранения.ПометкаУдаления
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ОтклонениеРаздел5
	               |ПОМЕСТИТЬ ВТСопоставленияФилиалВыкупов
	               |ИЗ
	               |	ВТТаблицаВыкуповИсточника КАК ВТТаблицаВыкуповИсточника
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ВыкупСОтветственногоХранения КАК ВыкупСОтветственногоХранения
	               |		ПО ВТТаблицаВыкуповИсточника.ГУИДФилиалВыкупа = ВыкупСОтветственногоХранения.ИДДокументаВСмежнойБазе
	               |			И (ВыкупСОтветственногоХранения.Ссылка.Дата >= &ДатаНачала)
	               |			И (ВыкупСОтветственногоХранения.Ссылка.Дата <= &ДатаОкончания)
	               |			И (ВыкупСОтветственногоХранения.Ссылка.Филиал = &Филиал)
	               |			И (&УсловиеПоКонтрагенту)
	               |			И (&УсловиеПоДоговору)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО (Контрагенты.КодМДМ = ВТТаблицаВыкуповИсточника.КодМДМКонтрагента)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""Непроведенные, не помеченные на удаление Большие и Малые выкупы"" КАК Раздел5,
	               |	ВТСопоставленияФилиалВыкупов.ФилиалВыкупРаздел5,
	               |	ВТСопоставленияФилиалВыкупов.ДатаФилиалВыкупаРаздел5,
	               |	ВТСопоставленияФилиалВыкупов.НомерФилиалВыкупаРаздел5,
	               |	ВТСопоставленияФилиалВыкупов.ПометкаУдаленияРаздел5,
	               |	ВТСопоставленияФилиалВыкупов.ПроведенРаздел5,
	               |	ВТСопоставленияФилиалВыкупов.ПроведенФилиалВыкупРаздел5,
	               |	ВТСопоставленияФилиалВыкупов.ПометкаУдаленияФилиалВыкупРаздел5,
	               |	ВТСопоставленияФилиалВыкупов.КонтрагентРаздел5,
	               |	ВТСопоставленияФилиалВыкупов.ГУИДФилиалВыкупаРаздел5
	               |ИЗ
	               |	ВТСопоставленияФилиалВыкупов КАК ВТСопоставленияФилиалВыкупов
	               |ГДЕ
	               |	ВТСопоставленияФилиалВыкупов.ОтклонениеРаздел5 = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("ДатаНачала", Макс(ДатаНачала, ДатаНачалаУчетаВФилиалах));
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	Если ЗначениеЗаполнено(ОтборПоКонтрагенту) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКонтрагенту", "ВыкупСОтветственногоХранения.Ссылка.Контрагент.КодМДМ В(&КодМДМКонтрагента)");
		Запрос.УстановитьПараметр("КодМДМКонтрагента", МассивКонтрагентов);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПоКонтрагенту", Истина);
	КонецЕсли;	
    Если ЗначениеЗаполнено(ОтборПоДоговору) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДоговору", "ВыкупСОтветственногоХранения.Ссылка.ДоговорКонтрагента.КодМДМ = &КодМДМДоговораКонтрагента");
		Запрос.УстановитьПараметр("КодМДМДоговораКонтрагента", МассивДоговоров);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПоДоговору", Истина);
	КонецЕсли;	
	Запрос.Текст = ТекстЗапроса;	
	
	Результат = Запрос.Выполнить();
	ТаблицаРаздела5 = Результат.Выгрузить();

	//Раздел 7. Сопоставление остатков регистра
	Запрос = БазаФилиал.NewObject("Запрос");
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТоварыТОХпоДаннымПоставщиковОстатки.Контрагент.КодМДМ КАК КодМДМКонтрагента,
	               |	ТоварыТОХпоДаннымПоставщиковОстатки.Договор.КодМДМ КАК КодМДМДоговораКонтрагента,
	               |	ТоварыТОХпоДаннымПоставщиковОстатки.Номенклатура.КодМДМ КАК КодМДМНоменклатуры,
	               |	СУММА(ТоварыТОХпоДаннымПоставщиковОстатки.КоличествоОстаток) КАК Количество
	               |ПОМЕСТИТЬ ВТИтоги
	               |ИЗ
	               |	РегистрНакопления.ТоварыТОХпоДаннымПоставщиков.Остатки(
	               |			&ДатаОкончания,
	               |			&УсловиеПоКонтрагенту
	               |				И &УсловиеПоДоговору) КАК ТоварыТОХпоДаннымПоставщиковОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыТОХпоДаннымПоставщиковОстатки.Номенклатура.КодМДМ,
	               |	ТоварыТОХпоДаннымПоставщиковОстатки.Контрагент.КодМДМ,
	               |	ТоварыТОХпоДаннымПоставщиковОстатки.Договор.КодМДМ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровНаОХ.Ссылка.Контрагент.КодМДМ,
	               |	ПоступлениеТоваровНаОХ.Ссылка.ДоговорКонтрагента.КодМДМ,
	               |	ПоступлениеТоваровНаОХ.Номенклатура.КодМДМ,
	               |	СУММА(ПоступлениеТоваровНаОХ.Количество)
	               |ИЗ
	               |	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОХ
	               |ГДЕ
	               |	&УсловиеПоКонтрагентуПТОХ И &УсловиеПоДоговоруПТОХ
	               |	И ПоступлениеТоваровНаОХ.Ссылка.Проведен
	               |	И ПоступлениеТоваровНаОХ.Ссылка.ДатаВходящегоДокумента <= &ДатаОкончания
	               |	И ПоступлениеТоваровНаОХ.Ссылка.Дата > &ДатаОкончания
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровНаОХ.Ссылка.Контрагент.КодМДМ,
	               |	ПоступлениеТоваровНаОХ.Ссылка.ДоговорКонтрагента.КодМДМ,
	               |	ПоступлениеТоваровНаОХ.Номенклатура.КодМДМ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТИтоги.КодМДМКонтрагента,
	               |	ВТИтоги.КодМДМДоговораКонтрагента,
	               |	ВТИтоги.КодМДМНоменклатуры,
	               |	ВТИтоги.Количество
	               |ИЗ
	               |	ВТИтоги КАК ВТИтоги";
	
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("УчитыватьСерии", УчитыватьСерии);
	
    Если ЗначениеЗаполнено(ОтборПоКонтрагенту) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКонтрагентуПТОХ", "ПоступлениеТоваровНаОХ.Ссылка.Контрагент.КодМДМ В(&КодМДМКонтрагента)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКонтрагенту", "Контрагент.КодМДМ В(&КодМДМКонтрагента)");
		Запрос.УстановитьПараметр("КодМДМКонтрагента", МассивКонтрагентовБазаФилиал);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПоКонтрагентуПТОХ", Истина);
		Запрос.УстановитьПараметр("УсловиеПоКонтрагенту", Истина);
	КонецЕсли;	
	
    Если ЗначениеЗаполнено(ОтборПоДоговору) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДоговоруПТОХ", "ПоступлениеТоваровНаОХ.Ссылка.ДоговорКонтрагента.КодМДМ = &КодМДМДоговораКонтрагента");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДоговору", "Договор.КодМДМ = &КодМДМДоговораКонтрагента");
		Запрос.УстановитьПараметр("КодМДМДоговораКонтрагента", МассивДоговоровБазаФилиал);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПоДоговоруПТОХ", Истина);
		Запрос.УстановитьПараметр("УсловиеПоДоговору", Истина);
	КонецЕсли;	
	Запрос.Текст = ТекстЗапроса;	
	
	РезультатБазаФилиал = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК КодМДМКонтрагента,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК КодМДМДоговораКонтрагента,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК КодМДМНоменклатуры,
	               |	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 3)) КАК Количество";

	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	ТЗ.Очистить();

	Выборка = РезультатБазаФилиал.Получить(0).Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаОстатковФилиала.КодМДМКонтрагента КАК КодМДМКонтрагента,
	               |	ТаблицаОстатковФилиала.КодМДМДоговораКонтрагента КАК КодМДМДоговораКонтрагента,
	               |	ТаблицаОстатковФилиала.КодМДМНоменклатуры КАК КодМДМНоменклатуры,
	               |	ТаблицаОстатковФилиала.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТТаблицаОстатковФилиала
	               |ИЗ
	               |	&ТЗ КАК ТаблицаОстатковФилиала
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыОтветственногоХраненияПереданныеОстатки.ДоговорКонтрагента.КодМДМ КАК КодМДМДоговораКонтрагента,
	               |	ТоварыОтветственногоХраненияПереданныеОстатки.Номенклатура.КодМДМ КАК КодМДМНоменклатуры,
	               |	ТоварыОтветственногоХраненияПереданныеОстатки.Контрагент.КодМДМ КАК КодМДМКонтрагента,
	               |	ТоварыОтветственногоХраненияПереданныеОстатки.КоличествоОстаток КАК Количество
	               |ПОМЕСТИТЬ ВТТаблицаОстатковЦентр
	               |ИЗ
	               |	РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Остатки(
	               |			&ДатаОкончания,
	               |			Филиал = &Филиал
	               |				И &УсловиеПоКонтрагенту
	               |				И &УсловиеПоДоговору) КАК ТоварыОтветственногоХраненияПереданныеОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТаблицаОстатковФилиала.КодМДМДоговораКонтрагента,
	               |	ВТТаблицаОстатковФилиала.КодМДМНоменклатуры,
	               |	ВТТаблицаОстатковФилиала.КодМДМКонтрагента,
	               |	ВТТаблицаОстатковФилиала.Количество КАК КоличествоИсточника,
	               |	0 КАК КоличествоПриемника
	               |ПОМЕСТИТЬ ВТТаблицаСопоставления
	               |ИЗ
	               |	ВТТаблицаОстатковФилиала КАК ВТТаблицаОстатковФилиала
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТТаблицаОстатковЦентр.КодМДМДоговораКонтрагента,
	               |	ВТТаблицаОстатковЦентр.КодМДМНоменклатуры,
	               |	ВТТаблицаОстатковЦентр.КодМДМКонтрагента,
	               |	0,
	               |	ВТТаблицаОстатковЦентр.Количество
	               |ИЗ
	               |	ВТТаблицаОстатковЦентр КАК ВТТаблицаОстатковЦентр
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТаблицаСопоставления.КодМДМДоговораКонтрагента,
	               |	ВТТаблицаСопоставления.КодМДМНоменклатуры,
	               |	ВТТаблицаСопоставления.КодМДМКонтрагента,
	               |	СУММА(ВТТаблицаСопоставления.КоличествоИсточника) КАК КоличествоИсточника,
	               |	СУММА(ВТТаблицаСопоставления.КоличествоПриемника) КАК КоличествоПриемника
	               |ПОМЕСТИТЬ ВТВремИтоги
	               |ИЗ
	               |	ВТТаблицаСопоставления КАК ВТТаблицаСопоставления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТТаблицаСопоставления.КодМДМДоговораКонтрагента,
	               |	ВТТаблицаСопоставления.КодМДМКонтрагента,
	               |	ВТТаблицаСопоставления.КодМДМНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""Сопоставление остатков регистров ГП и ОП"" КАК Раздел7,
	               |	ВТВремИтоги.КодМДМДоговораКонтрагента КАК КодМДМДоговораКонтрагентаРаздел7,
	               |	ВТВремИтоги.КодМДМНоменклатуры КАК КодМДМНоменклатурыРаздел7,
	               |	ВТВремИтоги.КодМДМКонтрагента КАК КодМДМКонтрагентаРаздел7,
	               |	ВТВремИтоги.КоличествоИсточника КАК КоличествоИсточникаРаздел7,
	               |	ВТВремИтоги.КоличествоПриемника КАК КоличествоПриемникаРаздел7,
	               |	ВТВремИтоги.КоличествоИсточника - ВТВремИтоги.КоличествоПриемника КАК ОтклонениеРаздел7,
	               |	СпрНоменклатура.Ссылка КАК НоменклатураРаздел7,
	               |	СпрКонтрагенты.Ссылка КАК КонтрагентРаздел7,
	               |	СпрДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагентаРаздел7
	               |ИЗ
	               |	ВТВремИтоги КАК ВТВремИтоги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	               |		ПО ВТВремИтоги.КодМДМНоменклатуры = СпрНоменклатура.КодМДМ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СпрКонтрагенты
	               |		ПО ВТВремИтоги.КодМДМКонтрагента = СпрКонтрагенты.КодМДМ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК СпрДоговорыКонтрагентов
	               |		ПО ВТВремИтоги.КодМДМДоговораКонтрагента = СпрДоговорыКонтрагентов.КодМДМ
	               |ГДЕ
	               |	ВТВремИтоги.КоличествоИсточника <> ВТВремИтоги.КоличествоПриемника
	               |	И НЕ СпрНоменклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
    Если ЗначениеЗаполнено(ОтборПоКонтрагенту) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКонтрагенту", "Контрагент.КодМДМ В(&КодМДМКонтрагента)");
		Запрос.УстановитьПараметр("КодМДМКонтрагента", МассивКонтрагентов);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПоКонтрагенту", Истина);
	КонецЕсли;	
    Если ЗначениеЗаполнено(ОтборПоДоговору) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДоговору", "ДоговорКонтрагенту.КодМДМ = &КодМДМДоговораКонтрагента");
		Запрос.УстановитьПараметр("КодМДМДоговораКонтрагента", МассивДоговоров);
	Иначе
		Запрос.УстановитьПараметр("УсловиеПоДоговору", Истина);
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	ТаблицаРаздела7 = Запрос.Выполнить().Выгрузить();
	
	//Раздел 8.
	Запрос = БазаФилиал.NewObject("Запрос");
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПоступлениеТоваровНаОХ.Ссылка КАК ГУИДФилиалВыкуп,
	               |	ПоступлениеТоваровНаОХ.Дата КАК ДатаФилиалВыкуп,
	               |	ПоступлениеТоваровНаОХ.Номер КАК НомерФилиалВыкуп,
	               |	ПоступлениеТоваровНаОХ.Проведен КАК ПроведенФилиалВыкуп,
	               |	ПоступлениеТоваровНаОХ.ПометкаУдаления КАК ПометкаУдаленияФилиалВыкуп,
	               |	ПоступлениеТоваровНаОХ.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               |	ПоступлениеТоваровНаОХ.Контрагент.КодМДМ КАК КодМДМКонтрагента,
	               |	ПоступлениеТоваровНаОХ.СуммаДокумента КАК СуммаДокументаФилиалВыкуп
	               |ИЗ
	               |	Документ.ПоступлениеТоваровНаОтветственноеХранение КАК ПоступлениеТоваровНаОХ
	               |ГДЕ
	               |	ПоступлениеТоваровНаОХ.ДатаВходящегоДокумента <= &ДатаОкончания
	               |	И ПоступлениеТоваровНаОХ.ДатаВходящегоДокумента >= &ДатаНачала
	               |
	               |";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	Запрос.Текст = ТекстЗапроса;	
	
	РезультатБазаФилиал = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ДАТАВРЕМЯ(1, 1, 1) КАК ДАТА) КАК ДатаФилиалВыкуп,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК НомерФилиалВыкуп,
	               |	ЛОЖЬ КАК ПроведенФилиалВыкуп,
	               |	ЛОЖЬ КАК ПометкаУдаленияФилиалВыкуп,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК НомерВходящегоДокумента,
				   |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК КодМДМКонтрагента,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ГУИДФилиалВыкуп,
	               |	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15,2)) КАК СуммаДокументаФилиалВыкуп
	               |";

	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	ТЗ.Очистить();

	Выборка = РезультатБазаФилиал.Получить(0).Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ГУИДФилиалВыкуп = БазаФилиал.XMLСтрока(Выборка.ГУИДФилиалВыкуп);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаВыкуповИсточника.ГУИДФилиалВыкуп КАК ГУИДФилиалВыкуп,
	               |	ТаблицаВыкуповИсточника.ДатаФилиалВыкуп КАК ДатаФилиалВыкуп,
	               |	ТаблицаВыкуповИсточника.НомерФилиалВыкуп КАК НомерФилиалВыкуп,
	               |	ТаблицаВыкуповИсточника.ПроведенФилиалВыкуп КАК ПроведенФилиалВыкуп,
	               |	ТаблицаВыкуповИсточника.ПометкаУдаленияФилиалВыкуп КАК ПометкаУдаленияФилиалВыкуп,
	               |	ТаблицаВыкуповИсточника.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               |	ТаблицаВыкуповИсточника.СуммаДокументаФилиалВыкуп КАК СуммаДокументаФилиалВыкуп
	               |ПОМЕСТИТЬ ВТТаблицаВыкуповИсточника
	               |ИЗ
	               |	&ТЗ КАК ТаблицаВыкуповИсточника
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугОХ.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТТаблицаРеализацийОХ
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.ТоварыОтветственногоХранения КАК РеализацияТоваровУслугОХ
	               |ГДЕ
	               |	РеализацияТоваровУслугОХ.Ссылка.Дата <= &ДатаОкончания
	               |	И РеализацияТоваровУслугОХ.Ссылка.Дата >= &ДатаНачала
	               |	И РеализацияТоваровУслугОХ.Ссылка.Грузополучатель = &Филиал
	               |	И РеализацияТоваровУслугОХ.Ссылка.ДоговорПоставщикаТОХ <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугОХ.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТаблицаРеализацийОХ.Ссылка КАК РеализацияОХРаздел8,
	               |	ВТТаблицаРеализацийОХ.Ссылка.ПометкаУдаления КАК ПометкаУдаленияРаздел8,
	               |	ВТТаблицаРеализацийОХ.Ссылка.Проведен КАК ПроведенРаздел8,
	               |	ВТТаблицаРеализацийОХ.Ссылка.СуммаДокумента КАК СуммаДокументаРаздел8,
	               |	ВТТаблицаВыкуповИсточника.ПроведенФилиалВыкуп КАК ПроведенФилиалВыкупРаздел8,
	               |	ВТТаблицаВыкуповИсточника.ПометкаУдаленияФилиалВыкуп КАК ПометкаУдаленияФилиалВыкупаРаздел8,
	               |	ВТТаблицаВыкуповИсточника.ГУИДФилиалВыкуп КАК ГУИДФилиалВыкупаРаздел8,
	               |	ВТТаблицаВыкуповИсточника.ДатаФилиалВыкуп КАК ДатаФилиалВыкупаРаздел8,
	               |	ВТТаблицаВыкуповИсточника.НомерФилиалВыкуп КАК НомерФилиалВыкупаРаздел8,
	               |	ВТТаблицаВыкуповИсточника.НомерВходящегоДокумента КАК НомерВходящегоДокументаФилиалВыкупРаздел8,
	               |	ВТТаблицаВыкуповИсточника.СуммаДокументаФилиалВыкуп КАК СуммаДокументаФилиалВыкупРаздел8,
	               |	ВЫБОР
	               |		КОГДА ВТТаблицаВыкуповИсточника.ПроведенФилиалВыкуп <> ВТТаблицаРеализацийОХ.Ссылка.Проведен
	               |				ИЛИ ВТТаблицаВыкуповИсточника.ПометкаУдаленияФилиалВыкуп <> ВТТаблицаРеализацийОХ.Ссылка.ПометкаУдаления
	               |				ИЛИ ВТТаблицаВыкуповИсточника.СуммаДокументаФилиалВыкуп <> ВТТаблицаРеализацийОХ.Ссылка.СуммаДокумента
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ОтклонениеРаздел8
	               |ПОМЕСТИТЬ ВТСопоставленияФилиалВыкупов
	               |ИЗ
	               |	ВТТаблицаВыкуповИсточника КАК ВТТаблицаВыкуповИсточника
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТТаблицаРеализацийОХ КАК ВТТаблицаРеализацийОХ
	               |		ПО ВТТаблицаВыкуповИсточника.НомерВходящегоДокумента = ВТТаблицаРеализацийОХ.Ссылка.Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""Сопоставление РТУ и ПТОХ цент и филиал"" КАК Раздел8,
	               |	ВТСопоставленияФилиалВыкупов.РеализацияОХРаздел8,
	               |	ВТСопоставленияФилиалВыкупов.СуммаДокументаРаздел8,
	               |	ВТСопоставленияФилиалВыкупов.ДатаФилиалВыкупаРаздел8,
	               |	ВТСопоставленияФилиалВыкупов.НомерФилиалВыкупаРаздел8,
	               |	ВТСопоставленияФилиалВыкупов.НомерВходящегоДокументаФилиалВыкупРаздел8,
	               |	ВТСопоставленияФилиалВыкупов.ПометкаУдаленияРаздел8,
	               |	ВТСопоставленияФилиалВыкупов.ПроведенРаздел8,
	               |	ВТСопоставленияФилиалВыкупов.ПроведенФилиалВыкупРаздел8,
	               |	ВТСопоставленияФилиалВыкупов.ПометкаУдаленияФилиалВыкупаРаздел8,
	               |	ВТСопоставленияФилиалВыкупов.СуммаДокументаФилиалВыкупРаздел8,
	               |	ВТСопоставленияФилиалВыкупов.ГУИДФилиалВыкупаРаздел8
	               |ИЗ
	               |	ВТСопоставленияФилиалВыкупов КАК ВТСопоставленияФилиалВыкупов
	               |ГДЕ
	               |	ВТСопоставленияФилиалВыкупов.ОтклонениеРаздел8 = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("ДатаНачала", Макс(ДатаНачала, ДатаНачалаУчетаВФилиалах));
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	Запрос.Текст = ТекстЗапроса;	
	
	Результат = Запрос.Выполнить();
	ТаблицаРаздела8 = Результат.Выгрузить();
	
	//Раздел 9
	Запрос = БазаФилиал.NewObject("Запрос");
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПоступлениеТоваровНаОХ.Ссылка КАК ГУИДФилиалВыкуп,
	               |	ПоступлениеТоваровНаОХ.Ссылка.Дата КАК ДатаФилиалВыкуп,
	               |	ПоступлениеТоваровНаОХ.Ссылка.Номер КАК НомерФилиалВыкуп,
	               |	ПоступлениеТоваровНаОХ.Номенклатура КАК Номенклатура,
	               |	ПоступлениеТоваровНаОХ.Номенклатура.КодМДМ КАК КодМДМНоменклатуры,
	               |	ПоступлениеТоваровНаОХ.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               |	ВЫБОР
	               |		КОГДА &УчитыватьСерии
	               |			ТОГДА ПоступлениеТоваровНаОХ.СерияНоменклатуры.НомерГТД.Код
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК СерияНоменклатуры,
	               |	СУММА(ПоступлениеТоваровНаОХ.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОХ
	               |ГДЕ
	               |	ПоступлениеТоваровНаОХ.Ссылка.ДатаВходящегоДокумента <= &ДатаОкончания
	               |	И ПоступлениеТоваровНаОХ.Ссылка.ДатаВходящегоДокумента >= &ДатаНачала
	               |	И ПоступлениеТоваровНаОХ.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА &УчитыватьСерии
	               |			ТОГДА ПоступлениеТоваровНаОХ.СерияНоменклатуры.НомерГТД.Код
	               |		ИНАЧЕ """"
	               |	КОНЕЦ,
	               |	ПоступлениеТоваровНаОХ.Ссылка,
	               |	ПоступлениеТоваровНаОХ.Номенклатура,
	               |	ПоступлениеТоваровНаОХ.Ссылка.Дата,
	               |	ПоступлениеТоваровНаОХ.Ссылка.Номер,
	               |	ПоступлениеТоваровНаОХ.Номенклатура.КодМДМ,
	               |	ПоступлениеТоваровНаОХ.Ссылка.НомерВходящегоДокумента";
	
	Запрос.УстановитьПараметр("УчитыватьСерии", УчитыватьСерии);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	Запрос.Текст = ТекстЗапроса;	
	
	РезультатБазаФилиал = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ДАТАВРЕМЯ(1, 1, 1) КАК ДАТА) КАК ДатаФилиалВыкуп,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК НомерФилиалВыкуп,
				   |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК СерияНоменклатуры,
				   |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК КодМДМНоменклатуры,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ГУИДФилиалВыкуп,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК НомерВходящегоДокумента,
	               |	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15,2)) КАК Количество
	               |";

	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	ТЗ.Очистить();

	Выборка = РезультатБазаФилиал.Получить(0).Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ГУИДФилиалВыкуп = БазаФилиал.XMLСтрока(Выборка.ГУИДФилиалВыкуп);
	КонецЦикла;
	
	//+Гавриленков В. 16.07.2025 #UT10-5338 В таблице ВТВремИтоги определено новое условие связи
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаВыкуповИсточника.ГУИДФилиалВыкуп КАК ГУИДФилиалВыкуп,
	               |	ТаблицаВыкуповИсточника.ДатаФилиалВыкуп КАК ДатаФилиалВыкуп,
	               |	ТаблицаВыкуповИсточника.НомерФилиалВыкуп КАК НомерФилиалВыкуп,
	               |	ТаблицаВыкуповИсточника.КодМДМНоменклатуры КАК КодМДМНоменклатуры,
	               |	ТаблицаВыкуповИсточника.СерияНоменклатуры КАК СерияНоменклатуры,
	               |	ТаблицаВыкуповИсточника.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               |	ТаблицаВыкуповИсточника.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТТаблицаВыкуповИсточника
	               |ИЗ
	               |	&ТЗ КАК ТаблицаВыкуповИсточника
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугОХ.Ссылка КАК Ссылка,
	               |	РеализацияТоваровУслугОХ.Ссылка.Номер КАК НомерРТУ,
	               |	РеализацияТоваровУслугОХ.Номенклатура.КодМДМ КАК КодМДМНоменклатуры,
	               |	ВЫБОР
	               |		КОГДА &УчитыватьСерии
	               |			ТОГДА РеализацияТоваровУслугОХ.СерияНоменклатуры.НомерГТД.Код
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК СерияНоменклатуры,
	               |	СУММА(РеализацияТоваровУслугОХ.Количество) КАК Количество,
	               |	СчетФактураВыданный.Номер КАК НомерСФ
	               |ПОМЕСТИТЬ ВТТаблицаРеализацийОХ
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.ТоварыОтветственногоХранения КАК РеализацияТоваровУслугОХ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	               |		ПО РеализацияТоваровУслугОХ.Ссылка = СчетФактураВыданный.ДокументОснование
	               |			И (СчетФактураВыданный.Проведен)
	               |ГДЕ
	               |	РеализацияТоваровУслугОХ.Ссылка.Дата <= &ДатаОкончания
	               |	И РеализацияТоваровУслугОХ.Ссылка.Дата >= &ДатаНачала
	               |	И РеализацияТоваровУслугОХ.Ссылка.Грузополучатель = &Филиал
	               |	И РеализацияТоваровУслугОХ.Ссылка.Проведен
	               |	И РеализацияТоваровУслугОХ.Ссылка.ДоговорПоставщикаТОХ <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугОХ.Ссылка,
	               |	РеализацияТоваровУслугОХ.Ссылка.Номер,
	               |	РеализацияТоваровУслугОХ.Номенклатура.КодМДМ,
	               |	ВЫБОР
	               |		КОГДА &УчитыватьСерии
	               |			ТОГДА РеализацияТоваровУслугОХ.СерияНоменклатуры.НомерГТД.Код
	               |		ИНАЧЕ """"
	               |	КОНЕЦ,
	               |	СчетФактураВыданный.Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТаблицаРеализацийОХ.Ссылка,
	               |	ЕСТЬNULL(ВТТаблицаРеализацийОХ.КодМДМНоменклатуры, ВТТаблицаВыкуповИсточника.КодМДМНоменклатуры) КАК КодМДМНоменклатуры,
	               |	ЕСТЬNULL(ВТТаблицаРеализацийОХ.СерияНоменклатуры, ВТТаблицаВыкуповИсточника.СерияНоменклатуры) КАК СерияНоменклатуры,
	               |	ВТТаблицаВыкуповИсточника.ГУИДФилиалВыкуп КАК ГУИДФилиал,
	               |	ВТТаблицаВыкуповИсточника.ДатаФилиалВыкуп КАК ДатаФилиал,
	               |	ВТТаблицаВыкуповИсточника.НомерФилиалВыкуп КАК НомерФилиал,
	               |	ВТТаблицаВыкуповИсточника.НомерВходящегоДокумента,
	               |	СУММА(ЕСТЬNULL(ВТТаблицаВыкуповИсточника.Количество, 0)) КАК КоличествоФилиал,
	               |	СУММА(ЕСТЬNULL(ВТТаблицаРеализацийОХ.Количество, 0)) КАК КоличествоЦентр
	               |ПОМЕСТИТЬ ВТВремИтоги
	               |ИЗ
	               |	ВТТаблицаРеализацийОХ КАК ВТТаблицаРеализацийОХ
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТТаблицаВыкуповИсточника КАК ВТТаблицаВыкуповИсточника
	               |		ПО (ВТТаблицаРеализацийОХ.НомерРТУ = ВТТаблицаВыкуповИсточника.НомерВходящегоДокумента
	               |				ИЛИ ВЫБОР
	               |					КОГДА &ПравилоФормированияНомераРостов
	               |						ТОГДА ЛЕВ(ВТТаблицаРеализацийОХ.НомерСФ, 3) ПОДОБНО ЛЕВ(ЕСТЬNULL(ВТТаблицаВыкуповИсточника.НомерВходящегоДокумента, ""СФНет""), 3)
	               |								И ПРАВ(ВТТаблицаРеализацийОХ.НомерСФ, 6) ПОДОБНО ПРАВ(ЕСТЬNULL(ВТТаблицаВыкуповИсточника.НомерВходящегоДокумента, ""СФНет""), 6)
	               |					ИНАЧЕ ВТТаблицаРеализацийОХ.НомерСФ ПОДОБНО ""%"" + ЕСТЬNULL(ВТТаблицаВыкуповИсточника.НомерВходящегоДокумента, ""СФНет"")
	               |				КОНЕЦ)
	               |			И ВТТаблицаРеализацийОХ.КодМДМНоменклатуры = ВТТаблицаВыкуповИсточника.КодМДМНоменклатуры
	               |			И ВТТаблицаРеализацийОХ.СерияНоменклатуры = ВТТаблицаВыкуповИсточника.СерияНоменклатуры
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТТаблицаРеализацийОХ.Ссылка,
	               |	ЕСТЬNULL(ВТТаблицаРеализацийОХ.КодМДМНоменклатуры, ВТТаблицаВыкуповИсточника.КодМДМНоменклатуры),
	               |	ЕСТЬNULL(ВТТаблицаРеализацийОХ.СерияНоменклатуры, ВТТаблицаВыкуповИсточника.СерияНоменклатуры),
	               |	ВТТаблицаВыкуповИсточника.ГУИДФилиалВыкуп,
	               |	ВТТаблицаВыкуповИсточника.ДатаФилиалВыкуп,
	               |	ВТТаблицаВыкуповИсточника.НомерФилиалВыкуп,
	               |	ВТТаблицаВыкуповИсточника.НомерВходящегоДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТВремИтоги.Ссылка,
	               |	ВТВремИтоги.КодМДМНоменклатуры,
	               |	ВТВремИтоги.СерияНоменклатуры,
	               |	ВТВремИтоги.ГУИДФилиал,
	               |	ВТВремИтоги.ДатаФилиал,
	               |	ВТВремИтоги.НомерФилиал,
	               |	ВТВремИтоги.НомерВходящегоДокумента,
	               |	ВТВремИтоги.КоличествоФилиал,
	               |	ВТВремИтоги.КоличествоЦентр,
	               |	ВТВремИтоги.КоличествоЦентр - ВТВремИтоги.КоличествоФилиал КАК Отклонение
	               |ПОМЕСТИТЬ ВТИтоги
	               |ИЗ
	               |	ВТВремИтоги КАК ВТВремИтоги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""Сопоставление РТУ и ПТОХ цент и филиал по номенклатуре"" КАК Раздел9,
	               |	ВТИтоги.Ссылка КАК РТУРаздел9,
	               |	ВТИтоги.КодМДМНоменклатуры КАК КодМДМНоменклатурыРаздел9,
	               |	ВТИтоги.СерияНоменклатуры КАК СерияНоменклатурыРаздел9,
	               |	ВТИтоги.ГУИДФилиал КАК ГУИДФилиалРаздел9,
	               |	ВТИтоги.ДатаФилиал КАК ДатаФилиалРаздел9,
	               |	ВТИтоги.НомерФилиал КАК НомерФилиалРаздел9,
	               |	ВТИтоги.НомерВходящегоДокумента КАК НомерВходящегоДокументаРаздел9,
	               |	ВТИтоги.КоличествоФилиал КАК КоличествоФилиалРаздел9,
	               |	ВТИтоги.КоличествоЦентр КАК КоличествоЦентрРаздел9,
	               |	ВТИтоги.Отклонение КАК ОтклонениеРаздел9,
	               |	Номенклатура.Ссылка КАК НоменклатураРаздел9
	               |ИЗ
	               |	ВТИтоги КАК ВТИтоги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |		ПО ВТИтоги.КодМДМНоменклатуры = Номенклатура.КодМДМ
	               |ГДЕ
	               |	ВТИтоги.Отклонение <> 0";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("УчитыватьСерии", УчитыватьСерии);
	Запрос.УстановитьПараметр("ДатаНачала", Макс(ДатаНачала, ДатаНачалаУчетаВФилиалах));
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	//+Гавриленков В. 16.07.2025 #UT10-5338
	Запрос.УстановитьПараметр("ПравилоФормированияНомераРостов", Константы.База.Получить() = Перечисления.НазваниеБазы.Ростов);
	//-Гавриленков В. 16.07.2025 #UT10-5338

	Запрос.Текст = ТекстЗапроса;	
	
	Результат = Запрос.Выполнить();
	ТаблицаРаздела9 = Результат.Выгрузить();
	
	ДанныеФилиалов = Новый Структура("ТаблицаРаздела4, ТаблицаРаздела5, ТаблицаРаздела7, ТаблицаРаздела8, ТаблицаРаздела9", ТаблицаРаздела4, ТаблицаРаздела5, ТаблицаРаздела7, ТаблицаРаздела8, ТаблицаРаздела9);
	Возврат ДанныеФилиалов;

КонецФункции

Функция ПодключитьсяКБазе()
	
	СтруктураПодключения = ПолучитьПараметрыПодключения();

	v8 = Новый COMОбъект("V83.COMConnector");
	ПутьКБазе = СтрШаблон("Srvr=""%1"";Ref=""%2"";Usr=""%3"";Pwd = ""%4"";", 
		СтруктураПодключения.ИмяСервера, 
		СтруктураПодключения.ИмяИнформационнойБазы, 
		СтруктураПодключения.Логин, 
		СтруктураПодключения.Пароль);
		
	База = v8.Connect(ПутьКБазе);
	Возврат База;
		
КонецФункции

Функция ПолучитьПараметрыПодключения()
	
	СтруктураПодключения = Новый Структура("ИмяСервера, ИмяИнформационнойБазы, Логин, Пароль", "", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационныеБазыФилиалов.ИмяСервера,
	               |	ИнформационныеБазыФилиалов.ИмяИнформационнойБазы,
	               |	ИнформационныеБазыФилиалов.Логин,
	               |	ИнформационныеБазыФилиалов.Пароль
	               |ИЗ
	               |	РегистрСведений.ИнформационныеБазыФилиалов КАК ИнформационныеБазыФилиалов
	               |ГДЕ
	               |	ИнформационныеБазыФилиалов.Филиал = &Филиал";
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПодключения, Выборка);
	КонецЕсли;
	
	Возврат СтруктураПодключения;
		
КонецФункции

Функция ПолучитьЗначениеПараметра(ИмяПараметра)
	
	ЗначениеПараметра = Неопределено;

	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если Параметр <> Неопределено  Тогда
		ЗначениеПараметра = Параметр.Значение;
	Иначе
		ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных(ИмяПараметра);
		Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиДанных И ЭлементОтбора.Использование Тогда
				ЗначениеПараметра = ЭлементОтбора.ПравоеЗначение;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ЗначениеПараметра;
	
КонецФункции

Функция УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра)
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если Параметр <> Неопределено  Тогда
		Параметр.Значение = ЗначениеПараметра;
	Иначе
		ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных(ИмяПараметра);
		Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиДанных И ЭлементОтбора.Использование Тогда
				ЭлементОтбора.ПравоеЗначение = ЗначениеПараметра;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ЗначениеПараметра;
	
КонецФункции

Функция УстановитьЗначениеОтбора(знач ИмяПараметра, ЗначениеПараметра)
	
	ИмяПараметра = СтрЗаменить(Имяпараметра, "Отбор", "");
	
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПараметра) Тогда
			ЭлементОтбора.ПравоеЗначение = ЗначениеПараметра;
			ЭлементОтбора.Использование = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ЗначениеПараметра;
	
КонецФункции
